from django.core.management.base import BaseCommand
from Front_pages.models import GeneralPage, BlockAndServices, AboutUs, Contacts, PageTarrif, SeoBlock, Services
from Gallery.models import Gallery, Image

class Command(BaseCommand):
    help = 'Create Pages'

    def handle(self, *args, **options):
        GeneralPage.objects.create(id=1, title='Про компанію', short_text="Житловий комплекс Nord розташований на Чорному морі в мальовничій зоні Одеси. Оригінальна архітектура комплексу робить його унікальним предметом не лише для Одеси, але й для всієї України - будинок ідеально вписується в архітектуру узбережжя і відкриває своїх жителів та гостей чудовим видом на нескінченне море. Яскравою перевагою житлового комплексу є його розташування - зручна транспортна розв'язка, соціальна інфраструктура, парк та відмінне морське повітря створюють усі умови для комфортного проживання.",
                                   seo_id=SeoBlock.objects.create(title_seo='Про компанію', description_seo='Опис компанії', keywords_seo='Keyword Компанії').id)

        BlockAndServices.objects.create(title='Магазини, Банки, Школи',
                                        description="Район розташування житлового комплексу має всю необхідну для проживання соціальну інфраструктуру – в безпосередній близькості знаходяться лікувально-профілактичні заклади, аптеки, магазини, відділення банків, приватні та комерційні дитячі садки, школи",
                                        generalPage_id=GeneralPage.objects.get(id=1).id)

        BlockAndServices.objects.create(title='Ресторани і кафе',
                                        description="Неподалік від житлового комплексу розташований рибний ресторан та італійська піцерія. Крім того, всього за десять хвилин ходьби від комплексу знаходяться ресторани іспанської, італійської, американської, української та російської кухні, піцерії, кафе та лаунж-бари на будь-який смак.",
                                        generalPage_id=GeneralPage.objects.get(id=1).id)

        BlockAndServices.objects.create(title='Пляж',
                                        description="Житловий комплекс розташований на березі Чорного моря у районі Аркадія. За десять хвилин ходьби від нього знаходяться знамениті пляжі Аркадія та Чайка, а трохи далі – пляжі курортний, 13-та станція Великого Фонтану, Пляжник та інші знамениті пляжі Одеси!",
                                        generalPage_id=GeneralPage.objects.get(id=1).id)

        BlockAndServices.objects.create(title='Спортивний комплекс',
                                        description="Всього в 5 хвилинах ходьби від житлового комплексу знаходиться Спортивний комплекс Міжнародного гуманітарного університету – це сучасний обладнаний комплекс із залами для проведення волейбольних змагань, змагань з танців та боротьби та інших спортивних заходів!",
                                        generalPage_id=GeneralPage.objects.get(id=1).id)

        BlockAndServices.objects.create(title='Клубне життя',
                                        description="Район розташування житлового комплексу Аркадія є культовим місцем нічного відпочинку та розваги – буквально за 5-10 хвилин ходьби від комплексу знаходяться такі місця зосередження клубного життя країни!",
                                        generalPage_id=GeneralPage.objects.get(id=1).id)

        BlockAndServices.objects.create(title="Зручна транспортна розв'язка",
                                        description="ЖК розташована на березі Чорного моря в районі Аркадії і має зручну транспортну розв'язку, що дозволяє навіть за годину Пік швидко та без проблем доїхати протягом десяти хвилин до центру міста чи виїхати на автостради Одеської обл!",
                                        generalPage_id=GeneralPage.objects.get(id=1).id)

        AboutUs.objects.create(title='Про нашу компанію',
                               short_text="Компанія-забудовник не лише створила цей об'єкт для своїх покупців, а й після закінчення будівництва взяла на себе всі послуги із забезпечення зручного проживання своїх мешканців. Для цього було організовано керуючу компанію «Морська симфонія», яка здійснює комплексне обслуговування комунальної сфери життєдіяльності своїх клієнтів. Місією компанії, що управляє, є така схема взаємодії з мешканцями будинку, при якій послуги компанії не відволікають їх від проживання та відпочинку і створюють максимально комфортну екосистему в будинку. Непомітний сервіс та максимально ефективна робота є візитною карткою компанії. У функції керуючої компанії входять як утримання та управління господарством комплексу, так і охоронюваної прибудинкової території – прибирання, технічне обслуговування ліфтового господарства, системи електро та водопостачання будинку, котельні та пожежної системи, диспетчеризація, охорона, утримання прибудинкової території та багато іншого. У штаті компанії зібрано лише професіо",
                               title_sec="Додатково про нас",
                               short_text_sec="Головним обов'язком керуючої компанії є підтримка комфортних умов для мешканців, оперативне реагування на їхні прохання та побажання Додаткові послуги керуючої компанії також належать: 24-годинна охорона прибудинкової території та паркінгу, прибирання території та вивіз сміття, обслуговування пірсу та пляжу. Також за бажання мешканці будинку можуть замовити будь-які будівельно-ремонтні роботи від штатної бригади компанії",
                               gallery_id=Gallery.objects.create(text='Про нашу компанію').id
                               )


        Contacts.objects.create(title='Контакти',
                                short_text="Компанія-забудовник не лише створила цей об'єкт для своїх покупців, а й після закінчення будівництва взяла на себе всі послуги із забезпечення зручного проживання своїх мешканців. Для цього було організовано керуючу компанію «Морська симфонія», яка здійснює комплексне обслуговування комунальної сфери життєдіяльності своїх клієнтів. Посилання на офіційний сайт - https://avada-media.ua",
                                fio='AVADA MEDIA',
                                location='м. Одеса, Малинівський р-н',
                                address='вул. Космонавтів, 32',
                                phone_number='0999999999',
                                email='avada-media.ua')